Autodesk.Revit.DB.IFC.IFCGeometryInfo.GetRepresentations
Gets the representation handles created representing the processed geometry and stored in this object.
Returns:
The collection of representation handles.
Since:
2013

Autodesk.Revit.DB.IFC.IFCGeometryInfo.GetFaces
Gets the IfcFace handles created representing the processed geometry and stored in this object.
Returns:
The collection of face handles.
Since:
2012

Autodesk.Revit.DB.IFC.IFCGeometryInfo.GetSurfaces
Gets the IfcSurface handles created representing the processed geometry and stored in this object.
Returns:
The collection of surface handles.
Since:
2012

Autodesk.Revit.DB.IFC.IFCGeometryInfo.GetCurves
Gets the IfcCurve handles created representing the processed geometry and stored in this object.
Returns:
The collection of curve handles.
Since:
2012

Autodesk.Revit.DB.IFC.IFCGeometryInfo.CreateFaceGeometryInfo(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.Plane,Autodesk.Revit.DB.XYZ,System.Double,System.Boolean)
Creates a new container object which holds IfcFace handles processed from a Revit geometry object.
ExporterIFC:
The exporter.
Plane:
The plane in which the face handles must lie.
ProjDir:
The normal vector to the input plane.
epsilon:
The epsilon value used to process surfaces.
createRepresentations:
Indicates if this should also create geometry representation handles.
Returns:
The new geometry info container.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2013

Autodesk.Revit.DB.IFC.IFCGeometryInfo.CreateFaceGeometryInfo(System.Double,System.Boolean)
Creates a new container object which holds IfcFace handles processed from a Revit geometry object.
epsilon:
The epsilon value used to process surfaces.
isCoarse:
Indicates whether we should use a coarse representation.
Returns:
The new geometry info container.
Since:
2013

Autodesk.Revit.DB.IFC.IFCGeometryInfo.CreateFaceGeometryInfo(System.Double)
Creates a new container object which holds IfcFace handles processed from a Revit geometry object.
epsilon:
The epsilon value used to process surfaces.
Returns:
The new geometry info container.
Since:
2012

Autodesk.Revit.DB.IFC.IFCGeometryInfo.CreateSurfaceGeometryInfo(System.Double)
Creates a new container object which holds IfcSurface handles processed from a Revit geometry object.
epsilon:
The epsilon value used to process surfaces.
Returns:
The new geometry info container.
Since:
2012

Autodesk.Revit.DB.IFC.IFCGeometryInfo.CreateCurveGeometryInfo(Autodesk.Revit.DB.IFC.ExporterIFC,Autodesk.Revit.DB.Transform,Autodesk.Revit.DB.XYZ,System.Boolean)
Creates a new container object which holds IfcCurve handles processed from a Revit geometry object.
ExporterIFC:
The exporter.
lcs:
The local coordinate system that defines the plane in which the curve handles must lie.
projectionDir:
The normal vector to the input plane.
planViewOnly:
True to match curves with plan view visibility only, false to match curves regardless of their plan view visibility.
Returns:
The new geometry info container.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.IFC.IFCGeometryInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.IFC.IFCGeometryInfo
A container class for Revit geometry extracted from an element.
Since:
2012